articles/app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY id DESC
---
	def index
		articles = Article.order('id');

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
	def show
		article = Article.find(params[:id])

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('Test ONe', 'sasfgdsgsdgsgsgggsdg', '2018-02-03 23:40:10', '2018-02-03 23:40:10')
---
	def create
		article = Article.new(article_params)

		if article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 7 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 7
---
	def destroy
		article = Article.find(params[:id])
		article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
UPDATE `articles` SET `title` = 'Updated Title', `body` = 'Updated body', `updated_at` = '2018-02-04 13:09:43' WHERE `articles`.`id` = 6
---
	def update
		article = Article.find(params[:id])
			if article.update_attributes(article_params)