articles/app/controllers/authentication_controller.rb

	def createuser
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Andre', 'example@mail.com', '$2a$10$Cle.pzCX8c2lQBslPlZZNOgkskQ0f5O53sZUMhiMr75UKBPgzvXGi', '2018-02-04 23:03:18', '2018-02-04 23:03:18')